webservices/solutions/lab13/soap-response.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" S:mustUnderstand="1">
            <ns1:EncryptedKey xmlns:ns1="http://www.w3.org/2001/04/xmlenc#" Id="SnJGQddsbVMiBYIs">
                <ns1:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p">
                    <ns2:DigestMethod xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                </ns1:EncryptionMethod>
                <ns3:KeyInfo xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">
                    <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="str_mGj8XNZbGLrFHltY">
                        <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">lq964TzTUZWfpFnpZ3YReaHMPFo=</wsse:KeyIdentifier>
                    </wsse:SecurityTokenReference>
                </ns3:KeyInfo>
                <ns1:CipherData>
                    <ns1:CipherValue>OeUM3kUebNeNYqak8YLMDRSVWlfCgL2VNUe7wyjJ3XsYl8boWnjP7BX410No/Pxmg80R3/8fCDtTVecH5Ga6djwby56VLdLPH/ypgJ35pYXCKqNTfhk69nYUgvmEJaD9peDyhsDvlHv9CCDolWvOuZyxpFfskHA4qM4UbwaosrCSwmw2lixkxKmiydSpe9MpMtLwzoKCXN8V/ADSbCZIx61a8fhybnZPhmzSLa5CDirSJCHvFD85rPZhtaPfDGjdOIiHeVhs2azcxydPDNcMjthh0XHlRYwueTnqin6o7MxQerA23Xlxp4WBT63ec5XZ3SWYtCBVN4tiUdFDjNI7UQ==</ns1:CipherValue>
                </ns1:CipherData>
                <ns1:ReferenceList>
                    <ns1:DataReference URI="#1LGbiFaYDyqJeszd"/>
                </ns1:ReferenceList>
            </ns1:EncryptedKey>
            <wsse11:SignatureConfirmation xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" Value="VNbST5oCXHSEv64LMxCdvj9/gxlUGxMXVVxpjr1jQXkb0i6VZq7SU3HSYgEfzHepZgw1GqvSjKlgjg5YLJULnbCs/dd/yuLQDUOsx58Bn/PsmFmapM89JVqMxwy0QZtXp/EkWZtQeUgRYdQocjTz2rYReLvHNN7tuPJgvewwj3IT/HluLNUf0ZkgwWA2t3YIU0ts28EQSP5c38U56pPUpZjntQdTcR4L/3Oi8LiUJj0LEBCvDAhJgv0+RH0ZJCvmtrvOkQPfY5p+Xt2D2OfAQhO3ScIyXwtPaR3mSuSuGdkCu1DelrRRZNIr4erGk1/mLxtgjWznfwXlUDkpo0o7OA==" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="sigconf_YN5A3L1QJX0nFtDD"/>
            <dsig:Signature xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
                <dsig:SignedInfo>
                    <dsig:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <dsig:Reference URI="#Timestamp_Uu61PTQYYhui2jb2">
                        <dsig:Transforms>
                            <dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </dsig:Transforms>
                        <dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <dsig:DigestValue>LZQkDKWdso+3+k6hoBpkscgFiDI=</dsig:DigestValue>
                    </dsig:Reference>
                    <dsig:Reference URI="#Body_iL9wYsG1FAE9XH0t">
                        <dsig:Transforms>
                            <dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </dsig:Transforms>
                        <dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <dsig:DigestValue>41tomlpXVaiXZ9+n4o5IonBQx/M=</dsig:DigestValue>
                    </dsig:Reference>
                    <dsig:Reference URI="#sigconf_YN5A3L1QJX0nFtDD">
                        <dsig:Transforms>
                            <dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </dsig:Transforms>
                        <dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <dsig:DigestValue>ySP3t8fGu/JcaocXI9s/l/gyYjg=</dsig:DigestValue>
                    </dsig:Reference>
                    <dsig:Reference URI="#str_VgLVYeCUKOAzDQPX">
                        <dsig:Transforms>
                            <dsig:Transform Algorithm="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#STR-Transform">
                                <wsse:TransformationParameters>
                                    <dsig:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                                </wsse:TransformationParameters>
                            </dsig:Transform>
                        </dsig:Transforms>
                        <dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <dsig:DigestValue>mwAogToMnThsXYLBdr59gmoeqyo=</dsig:DigestValue>
                    </dsig:Reference>
                </dsig:SignedInfo>
                <dsig:SignatureValue>QnWG6eCzgbnSytA7JiRFK6oxMdmvnGsraayDABxEx1KaiLp89NIwSFP/mLaUcrUdfaaP+Jd4fy+SYXs/4PdkaTGKREaOtQ5yYv8kDApAxYhx/xeec1VAiF9iqmr73k2y92U0XBEJIGT+6eHaXDK2X6GnUMBVpTe3uZG8TyH7YUrbZx7EnnEUkGvFHy4fxhSmaXPSM5LfmQEKvWRX9LjqcQWZwb8DJ9/jxjW5/1GMMoOh+qidbt8NfxFmAn1+cy0/97+lx7IQitBpysW45PAcgK2JpdueOf0gehL5X1rqeNoeqLJiaLGmXEwUAaYlSvkAJfFxFeppdt/Jzg+6lNsp+g==</dsig:SignatureValue>
                <dsig:KeyInfo>
                    <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="str_VgLVYeCUKOAzDQPX">
                        <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">IuTy/p6+UJVtg88hyww+r11H+5U=</wsse:KeyIdentifier>
                    </wsse:SecurityTokenReference>
                </dsig:KeyInfo>
            </dsig:Signature>
            <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp_Uu61PTQYYhui2jb2">
                <wsu:Created>2013-03-15T18:27:02Z</wsu:Created>
                <wsu:Expires>2013-03-15T18:28:02Z</wsu:Expires>
            </wsu:Timestamp>
        </wsse:Security>
    </S:Header>
    <S:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Body_iL9wYsG1FAE9XH0t">
        <ns1:EncryptedData xmlns:ns1="http://www.w3.org/2001/04/xmlenc#" Id="1LGbiFaYDyqJeszd" MimeType="text/xml" Type="http://www.w3.org/2001/04/xmlenc#Content">
            <ns1:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/>
            <ns1:CipherData>
                <ns1:CipherValue>DJaQ3T7JLjyVEdRLHfXEHGeb92N15mKqz9JZAncz3HHUicuRoEkQlVN+j+PYuiNKa6s7MwlHBZ4Fzg192GLT+fVvyoN9UIIhDOZ5LS3hQvY+s9cnmzmg5bAkLCvJakAXHth65KaQBXnGAcP7Lo/9W2cp4hyZ6r+kM4C22PmLVog=</ns1:CipherValue>
            </ns1:CipherData>
        </ns1:EncryptedData>
    </S:Body>
</S:Envelope>